In [1]:
import pandas as pd
import numpy as np

#Here we use pd.Series for pandas serizing
kulfi = ['Choclate','Mango','Vanilla']
kulfi = pd.Series(kulfi)

lottery = [4,5,6,7,8]
pd.Series(lottery)

reg = [True,False,False,True]
pd.Series(reg)

kulfi.values

array(['Choclate', 'Mango', 'Vanilla'], dtype=object)

In [2]:
Men = ['Smart','Handsome','Charming','Brilliant','Humble']
s = pd.Series(Men)

s.values # this all are attribute
s.index # This all no need () parenthesis

s.dtype #object mean strings

dtype('O')

In [3]:
#-------------Pandas Method-------------------

Rate = [3.99,4.55,6.52,7.91,4.44]
rate = pd.Series(Rate)

rate.sum() # Total
rate.product()
rate.mean() # Avarage

5.482

In [4]:
fruits = ['Apple','Mango','Watermelon','Pinaapple']
weekdays = ['Mon','Tue','Wed','Fri']

# pd.Series(fruits,weekdays)
# pd.Series(fruits,index=weekdays)
s = pd.Series(data=fruits,index=weekdays)
s['Tue']

'Mango'

In [5]:
a = pd.Series({2:'a', 1:'b', 3:'c'})

In [6]:
# Here "" must providable 
# pokemon = pd.read_csv("pokemon.csv",usecols=['Pokemon'],squeeze=True)
# p.head()
# p.tail()
# p.values
# p.index

In [7]:
# pokemon.name = 'Pokemon'
# pokemon.name
# pokemon
# pokemon.shape

In [8]:
# pokemon.sort_values().head(20)
pokemon = pd.read_csv("pokemon.csv",usecols=['Pokemon'],squeeze=True)
pokemon.head()

0     Bulbasaur
1       Ivysaur
2      Venusaur
3    Charmander
4    Charmeleon
Name: Pokemon, dtype: object

In [9]:
# --------------Values Sorting------------
pokemon.sort_values(ascending=False,inplace=True) #here inplace=True replace the main array

In [10]:
# --------------------Index sorting---------------
pokemon.sort_index(ascending=False,inplace=True)
pokemon.head()

720    Volcanion
719        Hoopa
718      Diancie
717      Zygarde
716      Yveltal
Name: Pokemon, dtype: object

In [11]:
# ----------------DataFrame---------------------

dict1 = {
    "name":['Harray','Emon','Hossen','skillf'],
    "marks":[92,82,76,88],
    "Speed":[34,212,123,222],
    "city":['rampur','noyakhali','Sariatpur','Dhaka']
}

In [12]:
df = pd.DataFrame(dict1) #This is a scale Sheet ..
df

     name  marks  Speed       city
0  Harray     92     34     rampur
1    Emon     82    212  noyakhali
2  Hossen     76    123  Sariatpur
3  skillf     88    222      Dhaka

In [13]:
df.to_csv('friends.csv') #To Create Excel Sheet or Csv file

In [14]:
df.to_csv('friends_index_false.csv',index=False) #With out index

In [15]:

df.head(2) #Its show start row
df.describe() #Its Use for all numaric values ..(******)
friend = pd.read_csv('friends.csv') #Read csv with pandas
friend

   Unnamed: 0    name  marks  Speed       city
0           0  Harray     92     34     rampur
1           1    Emon     82    212  noyakhali
2           2  Hossen     76    123  Sariatpur
3           3  skillf     88    222      Dhaka

In [16]:
a = {
    
    "Name":['Paddamati','Dhaka Express','Komolapur express'],
    "Train No":[12,33,11],
    "Speed":[220,330,440],
    "City":['Rajshahi','Dhaka','Cittaging'],
    
}

In [17]:
Railway = pd.DataFrame(a)
# Railway
Railway.to_csv('railway.csv',index=False) #Index False Must use

In [18]:
railway = pd.read_csv('railway.csv')
railway

                Name  Train No  Speed       City
0          Paddamati        12    220   Rajshahi
1      Dhaka Express        33    330      Dhaka
2  Komolapur express        11    440  Cittaging

In [19]:
railway['Speed'][0] = 210
railway.to_csv('railway.csv',index=False) #Here we change again our csv file

h:\python\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [20]:
railway.index = ['1st','2nd','3rd'] #Here We can change row and colum and index value
railway

                  Name  Train No  Speed       City
1st          Paddamati        12    210   Rajshahi
2nd      Dhaka Express        33    330      Dhaka
3rd  Komolapur express        11    440  Cittaging

In [21]:
# -------------------Series-----------------
ser = pd.Series(np.random.rand(34))
type(ser)

pandas.core.series.Series

In [22]:
newdf = pd.DataFrame(np.random.randint(1,334,(334,6)))

In [23]:
newdf.head()

     0    1    2    3    4    5
0   20  326  132  108  286  227
1   25  218  147   82  136   47
2  151  310  186  173  110   90
3   21   91  151  189   23  240
4   13  110  276  178  333  124

In [25]:
newdf.describe() #------Here describe function give count,max and etc item---------
newdf.dtypes #check Datatype
newdf.index #Check Index
newdf.columns #check columns

newdf.to_numpy() #To create numpy array 

newdf.T #for traverse 5 row 334 columns

newdf.columns = list("ABCDE") #Here We Can Change our Columns Name

newdf.head()
newdf2 = newdf.copy() #For copy
newdf2.loc[0]['A'] = 100000 #Here loc method change our value


# -------axis=1 means columns and axis=0 means row----------
newdf = newdf.drop('F',axis=1) #Here drop Function use for Delet Colum and row

AttributeError: 'list' object has no attribute 'describe'

In [51]:
# --------For show dataframe item and value----------
newdf3 = pd.DataFrame(np.random.randint(1,334,(334,6)))
newdf3.columns = list("ABCDEF")

# -------------loc-----------
newdf3.loc[[1,2],["C","D"]] #Here loc function Shows the exact item or value
newdf3.loc[[1],["C"]] = 3333  #Here we change it
newdf3.loc[[1,2],["C","D"]] #it not change ... 
newdf3.loc[[1,2],:] #This is show 1,2 row
newdf3.loc[:,["A","B"]] #This is show A,B columns



newdf3.head(2)
newdf3.iloc[0,0] #This is for iloc


newdf3.loc[[0,2],["A","B","C"]] # This is very helpful

     A    B    C
0  218  128   90
2  159   48  326

In [84]:
# -----------Droping or Deleting DataFrame row and columns-----

newdf3.drop([0,1], axis=0) #it delete the row 1,2
# newdf3.drop(["D","F"], axis=1) #it Delete columns A,B by axis=1
# newdf3 = newdf3.drop(["D","F"], axis=1) #HEre it delete those item
newdf3.head(10)
# newdf3.drop(["C"],axis=1,inplace=True) #It Delete The Item
newdf3.reset_index(drop=True,inplace=True) # It make True

# ---------Always use loc ---------------
newdf3.head()
newdf3.loc[[1]]

     E
1  115